const specialties = [
  {
    Код: 'A2',
    'Найменування спеціальності': 'Дошкільна освіта',
    Koefitients: {
      К1: 0.35,
      К2: 0.25,
      К3: 0.4,
      К4: {
        'іноземна мова': 0.4,
        біологія: 0.4,
        фізика: 0.35,
        хімія: 0.35,
        'українська література': 0.35,
        географія: 0.4,
      },
      КТ: null,
    },
  },
  {
    Код: 'A3',
    'Найменування спеціальності': 'Початкова освіта',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.25,
        фізика: 0.35,
        хімія: 0.35,
        'українська література': 0.35,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.01',
    'Найменування спеціальності':
      'Середня освіта (Українська мова і література)',
    Koefitients: {
      К1: 0.5,
      К2: 0.2,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.4,
        біологія: 0.25,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.5,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.02',
    'Найменування спеціальності':
      'Середня освіта (Мова та зарубіжна література (із зазначенням мови)) – для всіх інших мов',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.5,
        біологія: 0.25,
        фізика: 0.35,
        хімія: 0.35,
        'українська література': 0.4,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.03',
    'Найменування спеціальності':
      'Середня освіта (Історія та громадянська освіта)',
    Koefitients: {
      К1: 0.3,
      К2: 0.2,
      К3: 0.5,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.25,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.3,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.04',
    'Найменування спеціальності': 'Середня освіта (Математика)',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.3,
        фізика: 0.5,
        хімія: 0.4,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.05',
    'Найменування спеціальності':
      "Середня освіта (Біологія та здоров'я людини)",
    Koefitients: {
      К1: 0.3,
      К2: 0.35,
      К3: 0.35,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.5,
        фізика: 0.4,
        хімія: 0.4,
        'українська література': 0.3,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.06',
    'Найменування спеціальності': 'Середня освіта (Хімія)',
    Koefitients: {
      К1: 0.3,
      К2: 0.35,
      К3: 0.35,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.35,
        фізика: 0.45,
        хімія: 0.5,
        'українська література': 0.3,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.07',
    'Найменування спеціальності': 'Середня освіта (Географія)',
    Koefitients: {
      К1: 0.3,
      К2: 0.35,
      К3: 0.35,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.35,
        фізика: 0.45,
        хімія: 0.45,
        'українська література': 0.3,
        географія: 0.5,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.08',
    'Найменування спеціальності': 'Середня освіта (Фізика та астрономія)',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.3,
        фізика: 0.5,
        хімія: 0.4,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.09',
    'Найменування спеціальності': 'Середня освіта (Інформатика)',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.3,
        фізика: 0.5,
        хімія: 0.4,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.10',
    'Найменування спеціальності':
      'Середня освіта (Трудове навчання та технології)',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.3,
        фізика: 0.5,
        хімія: 0.4,
        'українська література': 0.3,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.11',
    'Найменування спеціальності': 'Середня освіта (Фізична культура)',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.3,
        фізика: 0.4,
        хімія: 0.4,
        'українська література': 0.3,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.12',
    'Найменування спеціальності': 'Середня освіта (Образотворче мистецтво)',
    Koefitients: {
      К1: 0.4,
      К2: 0.25,
      К3: 0.35,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.35,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.13',
    'Найменування спеціальності': 'Середня освіта (Музичне мистецтво)',
    Koefitients: {
      К1: 0.4,
      К2: 0.25,
      К3: 0.35,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.35,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.15',
    'Найменування спеціальності': 'Середня освіта (Природничі науки)',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.4,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.3,
        географія: 0.4,
      },
      КТ: null,
    },
  },
  {
    Код: 'A4.16',
    'Найменування спеціальності': 'Середня освіта (Захист України)',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.4,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.3,
        фізика: 0.4,
        хімія: 0.4,
        'українська література': 0.3,
        географія: 0.4,
      },
      КТ: null,
    },
  },
  {
    Код: 'A5.31, A5.32, A5.33, A5.39',
    'Найменування спеціальності': 'Професійна освіта (за спеціалізаціями)',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.3,
        фізика: 0.4,
        хімія: 0.4,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'A5.34, A5.35, A5.36, A5.37, A5.38',
    'Найменування спеціальності': 'Професійна освіта (за спеціалізаціями)',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.3,
        фізика: 0.4,
        хімія: 0.4,
        'українська література': 0.2,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'A5',
    'Найменування спеціальності':
      'Професійна освіта (за спеціалізаціями) – для інших спеціалізацій',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.3,
        фізика: 0.5,
        хімія: 0.4,
        'українська література': 0.3,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'A6',
    'Найменування спеціальності': 'Спеціальна освіта',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.5,
        фізика: 0.4,
        хімія: 0.4,
        'українська література': 0.3,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'A7',
    'Найменування спеціальності': 'Фізична культура і спорт',
    Koefitients: {
      К1: 0.25,
      К2: 0.2,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.2,
        біологія: 0.2,
        фізика: 0.2,
        хімія: 0.2,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: 0.25,
    },
  },
  {
    Код: 'B1',
    'Найменування спеціальності': 'Аудіовізуальне мистецтво та виробництво',
    Koefitients: {
      К1: 0.25,
      К2: 0.2,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.2,
        біологія: 0.2,
        фізика: 0.2,
        хімія: 0.2,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: 0.6,
    },
  },
  {
    Код: 'B2',
    'Найменування спеціальності': 'Дизайн ',
    Koefitients: {
      К1: 0.25,
      К2: 0.2,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.2,
        біологія: 0.2,
        фізика: 0.2,
        хімія: 0.2,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: 0.6,
    },
  },
  {
    Код: 'B3',
    'Найменування спеціальності': 'Декоративне мистецтво та ремесла',
    Koefitients: {
      К1: 0.1,
      К2: 0.1,
      К3: 0.1,
      К4: {
        'іноземна мова': 0.1,
        біологія: 0.1,
        фізика: 0.1,
        хімія: 0.1,
        'українська література': 0.1,
        географія: 0.1,
      },
      КТ: 0.6,
    },
  },
  {
    Код: 'B4',
    'Найменування спеціальності': 'Образотворче мистецтво та реставрація',
    Koefitients: {
      К1: 0.1,
      К2: 0.1,
      К3: 0.1,
      К4: {
        'іноземна мова': 0.1,
        біологія: 0.1,
        фізика: 0.1,
        хімія: 0.1,
        'українська література': 0.1,
        географія: 0.1,
      },
      КТ: 0.6,
    },
  },
  {
    Код: 'B5',
    'Найменування спеціальності': 'Музичне мистецтво',
    Koefitients: {
      К1: 0.1,
      К2: 0.1,
      К3: 0.1,
      К4: {
        'іноземна мова': 0.1,
        біологія: 0.1,
        фізика: 0.1,
        хімія: 0.1,
        'українська література': 0.1,
        географія: 0.1,
      },
      КТ: 0.6,
    },
  },
  {
    Код: 'B6',
    'Найменування спеціальності': 'Перформативні мистецтва',
    Koefitients: {
      К1: 0.1,
      К2: 0.1,
      К3: 0.1,
      К4: {
        'іноземна мова': 0.1,
        біологія: 0.1,
        фізика: 0.1,
        хімія: 0.1,
        'українська література': 0.1,
        географія: 0.1,
      },
      КТ: 0.6,
    },
  },
  {
    Код: 'B7',
    'Найменування спеціальності': 'Релігієзнавство',
    Koefitients: {
      К1: 0.3,
      К2: 0.25,
      К3: 0.45,
      К4: {
        'іноземна мова': 0.45,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.45,
        географія: 0.45,
      },
      КТ: null,
    },
  },
  {
    Код: 'B8',
    'Найменування спеціальності': 'Богослов’я',
    Koefitients: {
      К1: 0.3,
      К2: 0.25,
      К3: 0.45,
      К4: {
        'іноземна мова': 0.45,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.45,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'B9',
    'Найменування спеціальності': 'Історія та археологія',
    Koefitients: {
      К1: 0.25,
      К2: 0.25,
      К3: 0.5,
      К4: {
        'іноземна мова': 0.5,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'B10',
    'Найменування спеціальності': 'Філософія',
    Koefitients: {
      К1: 0.35,
      К2: 0.25,
      К3: 0.4,
      К4: {
        'іноземна мова': 0.4,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.35,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'B11.01, B11.09, В11,10',
    'Найменування спеціальності':
      'Філологія (за спеціалізаціями: українська мова та література, фольклористика, прикладна лінгвістика)',
    Koefitients: {
      К1: 0.5,
      К2: 0.25,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.5,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'B11 ',
    'Найменування спеціальності':
      'Філологія (за спеціалізаціями) – для інших спеціалізацій',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.4,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.4,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'B12',
    'Найменування спеціальності': 'Культурологія та музеєзнавство',
    Koefitients: {
      К1: 0.25,
      К2: 0.25,
      К3: 0.5,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.25,
        географія: 0.5,
      },
      КТ: null,
    },
  },
  {
    Код: 'B13',
    'Найменування спеціальності': 'Бібліотечна, інформаційна та архівна справа',
    Koefitients: {
      К1: 0.35,
      К2: 0.25,
      К3: 0.4,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.35,
        географія: 0.4,
      },
      КТ: null,
    },
  },
  {
    Код: 'C1',
    'Найменування спеціальності': 'Економіка',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.25,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'C2',
    'Найменування спеціальності': 'Політологія',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'C3',
    'Найменування спеціальності': 'Міжнародні відносини',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.5,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.3,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'C4',
    'Найменування спеціальності': 'Психологія',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.4,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'C5',
    'Найменування спеціальності': 'Соціологія',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'C6',
    'Найменування спеціальності': 'Географія та регіональні студії',
    Koefitients: {
      К1: 0.3,
      К2: 0.35,
      К3: 0.35,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.35,
        фізика: 0.45,
        хімія: 0.45,
        'українська література': 0.2,
        географія: 0.5,
      },
      КТ: null,
    },
  },
  {
    Код: 'C7',
    'Найменування спеціальності': 'Журналістика',
    Koefitients: {
      К1: 0.45,
      К2: 0.3,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.45,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'D1',
    'Найменування спеціальності': 'Облік і оподаткування',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.25,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'D2',
    'Найменування спеціальності':
      'Фінанси, банківська справа, страхування та фондовий ринок',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.25,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'D3',
    'Найменування спеціальності': 'Менеджмент',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.25,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'D4',
    'Найменування спеціальності': 'Публічне управління та адміністрування',
    Koefitients: {
      К1: 0.3,
      К2: 0.4,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.5,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'D5',
    'Найменування спеціальності': 'Маркетинг',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.25,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'D7',
    'Найменування спеціальності': 'Торгівля',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.25,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'D8',
    'Найменування спеціальності': 'Право',
    Koefitients: {
      К1: 0.35,
      К2: 0.25,
      К3: 0.4,
      К4: {
        'іноземна мова': 0.4,
        біологія: 0.25,
        фізика: 0.35,
        хімія: 0.35,
        'українська література': 0.35,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'D9',
    'Найменування спеціальності': 'Міжнародне право',
    Koefitients: {
      К1: 0.4,
      К2: 0.2,
      К3: 0.4,
      К4: {
        'іноземна мова': 0.5,
        біологія: 0.2,
        фізика: 0.3,
        хімія: 0.3,
        'українська література': 0.3,
        географія: 0.4,
      },
      КТ: null,
    },
  },
  {
    Код: 'E1',
    'Найменування спеціальності': 'Біологія та біохімія',
    Koefitients: {
      К1: 0.3,
      К2: 0.35,
      К3: 0.35,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.5,
        фізика: 0.45,
        хімія: 0.45,
        'українська література': 0.2,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'E2',
    'Найменування спеціальності': 'Екологія',
    Koefitients: {
      К1: 0.3,
      К2: 0.35,
      К3: 0.35,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.4,
        фізика: 0.45,
        хімія: 0.5,
        'українська література': 0.3,
        географія: 0.4,
      },
      КТ: null,
    },
  },
  {
    Код: 'E3',
    'Найменування спеціальності': 'Хімія',
    Koefitients: {
      К1: 0.3,
      К2: 0.35,
      К3: 0.35,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.35,
        фізика: 0.45,
        хімія: 0.5,
        'українська література': 0.2,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'E4',
    'Найменування спеціальності': 'Науки про Землю',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.35,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.25,
        географія: 0.5,
      },
      КТ: null,
    },
  },
  {
    Код: 'E5',
    'Найменування спеціальності': 'Фізика та астрономія',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.25,
        фізика: 0.5,
        хімія: 0.4,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'E6',
    'Найменування спеціальності': 'Прикладна фізика та наноматеріали',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.25,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'E7',
    'Найменування спеціальності': 'Математика',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.2,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'E8',
    'Найменування спеціальності': 'Статистика',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.2,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'F1',
    'Найменування спеціальності': 'Прикладна математика',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'F2',
    'Найменування спеціальності': 'Інженерія програмного забезпечення',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'F3',
    'Найменування спеціальності': "Комп'ютерні науки",
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'F4',
    'Найменування спеціальності': 'Системний аналіз',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'F5',
    'Найменування спеціальності': 'Кібербезпека та захист інформації',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'F6',
    'Найменування спеціальності': 'Інформаційні системи та технології',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'F7',
    'Найменування спеціальності': "Комп'ютерна інженерія",
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G1',
    'Найменування спеціальності': 'Хімічні технології та інженерія',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.3,
        фізика: 0.3,
        хімія: 0.5,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G2',
    'Найменування спеціальності': 'Технології захисту навколишнього середовища',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G3',
    'Найменування спеціальності': 'Електрична інженерія',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G4',
    'Найменування спеціальності': 'Енерговиробництво (за спеціалізацією)',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G5',
    'Найменування спеціальності':
      'Електроніка, електронні комунікації та радіотехніка',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G6',
    'Найменування спеціальності': 'Інформаційно-вимірювальні технології',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G7',
    'Найменування спеціальності':
      "Автоматизація, комп'ютерно-інтегровані технології та робототехніка",
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G8',
    'Найменування спеціальності': 'Матеріалознавство',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G9',
    'Найменування спеціальності': 'Прикладна механіка',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G10',
    'Найменування спеціальності': 'Металургія',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G11',
    'Найменування спеціальності': 'Машинобудування (за спеціалізаціями)',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G12',
    'Найменування спеціальності': 'Авіаційна та ракетно-космічна техніка',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G13',
    'Найменування спеціальності': 'Харчові технології',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G14',
    'Найменування спеціальності': 'Деревообробні та меблеві технології',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G15',
    'Найменування спеціальності': 'Технології легкої промисловості',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G16',
    'Найменування спеціальності': 'Гірництво та нафтогазові технології',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.2,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'G17',
    'Найменування спеціальності': 'Архітектура та містобудування',
    Koefitients: {
      К1: 0.1,
      К2: 0.1,
      К3: 0.1,
      К4: {
        'іноземна мова': 0.1,
        біологія: 0.1,
        фізика: 0.1,
        хімія: 0.1,
        'українська література': 0.1,
        географія: 0.1,
      },
      КТ: 0.6,
    },
  },
  {
    Код: 'G18',
    'Найменування спеціальності': 'Геодезія та землеустрій',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G19',
    'Найменування спеціальності': 'Будівництво та цивільна інженерія',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G20',
    'Найменування спеціальності': 'Видавництво та поліграфія',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'G21',
    'Найменування спеціальності': 'Біотехнології та біоінженерія',
    Koefitients: {
      К1: 0.35,
      К2: 0.35,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.25,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'G22',
    'Найменування спеціальності': 'Біомедична інженерія',
    Koefitients: {
      К1: 0.35,
      К2: 0.35,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.25,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'H1',
    'Найменування спеціальності': 'Агрономія',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.5,
        фізика: 0.4,
        хімія: 0.5,
        'українська література': 0.3,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'H2',
    'Найменування спеціальності': 'Тваринництво',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.3,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'H3',
    'Найменування спеціальності': 'Садово-паркове господарство',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'H4',
    'Найменування спеціальності': 'Лісове господарство',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.4,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'H5',
    'Найменування спеціальності': 'Водні біоресурси та аквакультура',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.3,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'H6',
    'Найменування спеціальності': 'Ветеринарна медицина',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.4,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'H7',
    'Найменування спеціальності': 'Агроінженерія',
    Koefitients: {
      К1: 0.3,
      К2: 0.4,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.4,
        'українська література': 0.25,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'I1',
    'Найменування спеціальності': 'Стоматологія',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.45,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'I2',
    'Найменування спеціальності': 'Медицина',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.45,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'I3',
    'Найменування спеціальності': 'Педіатрія',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.45,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'I4',
    'Найменування спеціальності': 'Медична психологія',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.45,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'I5',
    'Найменування спеціальності': 'Медсестринство (за спеціалізаціями)',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.45,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'I6',
    'Найменування спеціальності':
      'Технології медичної діагностики та лікування (за спеціалізаціями)',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.45,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'I7',
    'Найменування спеціальності':
      'Терапія та реабілітація (за спеціалізаціями)',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.45,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'I8',
    'Найменування спеціальності': 'Фармація (за спеціалізаціями)',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.5,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'I9',
    'Найменування спеціальності': "Громадське здоров'я",
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.5,
        фізика: 0.5,
        хімія: 0.45,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'I10',
    'Найменування спеціальності': 'Соціальна робота та консультування',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.25,
        фізика: 0.35,
        хімія: 0.35,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'I11',
    'Найменування спеціальності': 'Дитячі та молодіжні служби',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.25,
        фізика: 0.35,
        хімія: 0.35,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'J2',
    'Найменування спеціальності': 'Готельно-ресторанна справа та кейтеринг',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.5,
        біологія: 0.3,
        фізика: 0.35,
        хімія: 0.4,
        'українська література': 0.3,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'J3',
    'Найменування спеціальності': 'Туризм і рекреація',
    Koefitients: {
      К1: 0.4,
      К2: 0.3,
      К3: 0.3,
      К4: {
        'іноземна мова': 0.5,
        біологія: 0.35,
        фізика: 0.35,
        хімія: 0.35,
        'українська література': 0.3,
        географія: 0.3,
      },
      КТ: null,
    },
  },
  {
    Код: 'J4',
    'Найменування спеціальності': 'Охорона праці',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.35,
        фізика: 0.45,
        хімія: 0.45,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'J5',
    'Найменування спеціальності':
      'Морський та внутрішній водний транспорт (всі спеціалізації)',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.5,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'J6',
    'Найменування спеціальності': 'Авіаційний транспорт',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.5,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'J7',
    'Найменування спеціальності': 'Залізничний транспорт',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.5,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'J8',
    'Найменування спеціальності': 'Автомобільний транспорт',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.5,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'K3',
    'Найменування спеціальності':
      'Національна безпека (за окремими сферами забезпечення і видами діяльності)',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'K4',
    'Найменування спеціальності': 'Управління інформаційною безпекою',
    Koefitients: {
      К1: 0.3,
      К2: 0.5,
      К3: 0.2,
      К4: {
        'іноземна мова': 0.3,
        біологія: 0.2,
        фізика: 0.5,
        хімія: 0.3,
        'українська література': 0.2,
        географія: 0.2,
      },
      КТ: null,
    },
  },
  {
    Код: 'K8',
    'Найменування спеціальності': 'Пожежна безпека',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.3,
        фізика: 0.45,
        хімія: 0.45,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
  {
    Код: 'K9',
    'Найменування спеціальності': 'Правоохоронна діяльність',
    Koefitients: {
      К1: 0.35,
      К2: 0.3,
      К3: 0.35,
      К4: {
        'іноземна мова': 0.35,
        біологія: 0.3,
        фізика: 0.35,
        хімія: 0.35,
        'українська література': 0.25,
        географія: 0.35,
      },
      КТ: null,
    },
  },
  {
    Код: 'K10',
    'Найменування спеціальності': 'Цивільна безпека',
    Koefitients: {
      К1: 0.35,
      К2: 0.4,
      К3: 0.25,
      К4: {
        'іноземна мова': 0.25,
        біологія: 0.35,
        фізика: 0.45,
        хімія: 0.45,
        'українська література': 0.25,
        географія: 0.25,
      },
      КТ: null,
    },
  },
];

function validateScores(P1, P2, P3, P4) {
  return (
    P1 >= 100 &&
    P1 <= 200 &&
    P2 >= 100 &&
    P2 <= 200 &&
    P3 >= 100 &&
    P3 <= 200 &&
    P4 >= 100 &&
    P4 <= 200
  );
}

function calculate() {
  const P1 = parseFloat(document.getElementById('P1').value);
  const P2 = parseFloat(document.getElementById('P2').value);
  const P3 = parseFloat(document.getElementById('P3').value);
  const subject4 = document.getElementById('subject4').value;
  const P4 = parseFloat(document.getElementById('P4').value) || 0;
  const TK = parseFloat(document.getElementById('TK').value) || 0;

  if (!validateScores(P1, P2, P3, P4)) {
    document.getElementById('result').textContent =
      'Будь ласка, введіть коректні оцінки (від 100 до 200) для всіх предметів.';
    return;
  }

  let results = specialties
    .map(spec => {
      const K1 = spec.Koefitients.К1;
      const K2 = spec.Koefitients.К2;
      const K3 = spec.Koefitients.К3;
      const K4 = spec.Koefitients.К4[subject4]; // Звертаємося до вкладеної властивості
      const maxK4 = Math.max(...Object.values(spec.Koefitients.К4));
      const KT = spec.Koefitients.КТ || 0;
      // console.log("spec", spec.Koefitients.К4,"Макс К4:", maxK4);
      console.log(spec, subject4);
      if (K4 === undefined) {
        console.error(
          `Предмет ${subject4} відсутній у спеціальності ${spec.Код}`
        );
        return null; // Пропустити цю спеціальність, якщо K4 не визначений
      }

      const KB2025 =
        (K1 * P1 + K2 * P2 + K3 * P3 + K4 * P4 + KT * TK) /
        (K1 + K2 + K3 + maxK4 + KT);
      const KB2024 =
        (K1 * P1 + K2 * P2 + K3 * P3 + K4 * P4 + KT * TK) /
        (K1 + K2 + K3 + K4 + KT);

      return {
        Код: spec.Код,
        'Освітня програма': spec['Найменування спеціальності'],
        'Конкурсний бал': KB2025,
        'K max': maxK4,
        KБ2024: KB2024,
        KTRequired: KT > 0,
        Details: {
          P1,
          P2,
          P3,
          P4,
          TK,
          K1,
          K2,
          K3,
          K4,
          maxK4,
          KB2025,
          KB2024,
          KT,
        },
      };
    })
    .filter(Boolean); // Видаляємо null значення з результатів

  results.sort((a, b) => b['Конкурсний бал'] - a['Конкурсний бал']);

  let tableHtml = `
      <table>
        <thead>
          <tr>
            <th onclick="sortTable(0)">Код</th>
            <th onclick="sortTable(1)">Освітня програма</th>
            <th onclick="sortTable(2)">Конкурсний бал</th>
            <th>K max</th>
            <th>KБ2024</th>
          </tr>
        </thead>
        <tbody>
    `;

  results.forEach((result, index) => {
    // console.log("result",result);
    let warningHtml = '';
    if (
      ['081', '291', '292'].includes(result.Код) &&
      result['Конкурсний бал'] < 150
    ) {
      warningHtml = `
                <span class="tooltip warning"> ❗ 
                  <span class="tooltiptext">Для вступу на цю конкурсну пропозицію мінімальний бал має бути більше 150</span>
                </span>
            `;
    } else if (result['KTRequired'] && TK === 0) {
      warningHtml = `
                <span class="tooltip warning">❌
                  <span class="tooltiptext">Для даної конкурсної пропозиції необхідні результати творчого конкурсу</span>
                </span>
            `;
    } else if (result['Конкурсний бал'] < 130) {
      warningHtml = `
                <span class="tooltip yellow-warning">⚠️
                  <span class="tooltiptext">Для можливості претендувати на навчання за кошти Держ. бюджету КБ має бути більше 130</span>
                </span>
            `;
    }

    tableHtml += `
          <tr>
          <td class="kod">${result.Код}</td>
          <td class="osvpr">${result['Освітня програма']}</td>
          <td class="bal">${result['Конкурсний бал'].toFixed(
            2
          )}${warningHtml} <button class="calculator-btn" onclick="showCalculationDetails(${index})">🧮</button></td>
          <td class="K max">${result['K max']}</td>
          <td class="KБ2024">${result['KБ2024'].toFixed(2)}</td>
          </tr>
        `;
  });

  tableHtml += '</tbody></table>';

  document.getElementById('result').innerHTML = tableHtml;
  // Зберігаємо результати для використання у функції showCalculationDetails
  window.calculationResults = results;
}
function showCalculationDetails(index) {
  const result = window.calculationResults[index];
  const details = result.Details;

  const modalDetails = `
      <p><b>Спеціальність:</b> ${result['Освітня програма']}</p>
      <p><b>Формула 2025:</b> (K1 * P1 + K2 * P2 + K3 * P3 + K4 * P4 + KT * TK) / 
        (K1 + K2 + K3 + max(K4) + KT)</p>
      <p><b>Розрахунок:</b> (${details.K1} * ${details.P1} + ${details.K2} * ${
    details.P2
  } + 
        ${details.K3} * ${details.P3} + ${details.K4} * ${details.P4} + ${
    details.KT
  } * ${details.TK}) / 
        (${details.K1} + ${details.K2} + ${details.K3} + ${details.maxK4} + ${
    details.KT
  })</p>
      <p><b>Результат 2025:</b> ${details.KB2025.toFixed(2)}</p>
      <hr>
      <p><b>Формула 2024:</b> (K1 * P1 + K2 * P2 + K3 * P3 + K4 * P4 + KT * TK) / 
        (K1 + K2 + K3 + K4 + KT)</p>
      <p><b>Результат 2024:</b> ${details.KB2024.toFixed(2)}</p>
    `;

  document.getElementById('modal-details').innerHTML = modalDetails;

  // Показуємо модальне вікно
  const modal = document.getElementById('calculation-modal');
  modal.style.display = 'block';

  // Закриваємо модальне вікно при натисканні на "x"
  document.querySelector('.close-btn').onclick = () => {
    modal.style.display = 'none';
  };

  // Закриваємо модальне вікно при кліку поза його межами
  window.onclick = event => {
    if (event.target === modal) {
      modal.style.display = 'none';
    }
  };
}
